import React from "react";

function WhyUs() {
  return (
    <div className="parent-why-company h-[800px] w-full mt-20">
      <div className="header-whyus flex justify-center  ">
        <p className="why-our-company-head h-[42px] text-[#FEA501] w-[117px] bg-[#FFF3DE] rounded-[8px]  flex justify-center items-center">
          لماذا نحن
        </p>
        <p className="text-4xl mobile-text">
          نحن نعطي الأولوية للجودة والموثوقية ورضا العملاء.
        </p>
      </div>
      <div className="why-our-company-container flex gap-28">
        <div className="left-whuus w-[35%] ">
          <div className="relative images-containerWhyUs">
            <img
              className="vectore-img vectore-img2 h-[800px]"
              src="/vector2.svg"
              alt=""
            />
            <img
              className="vectore-img vectore-img-car absolute top-[200px]"
              src="/audi1.png"
              alt=""
            />
            <img
              className="vectore-img vectore-img-can absolute top-[500px]"
              src="/can.png"
              alt=""
            />
          </div>
        </div>
        <div className="right-whuus w-[65%] pt-28 font-bold">
          <p className="text-4xl hide-on-mobile">
            نحن نعطي الأولوية للجودة والموثوقية ورضا العملاء.
          </p>
          <div className="content mt-16 flex flex-col gap-24">
            <div className="content-slice flex gap-10 items-center rounded-xl">
              <div className="icon-div flex justify-center items-center bg-[#FFF3DE] h-[64px] w-[64px]  rounded-xl">
                <p>
                  <svg
                    width="24"
                    height="25"
                    viewBox="0 0 24 25"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M11.9402 2.71001L9.5302 8.32001H7.1202C6.7202 8.32001 6.3302 8.35001 5.9502 8.43001L6.9502 6.03001L6.9902 5.94001L7.0502 5.78001C7.0802 5.71001 7.1002 5.65001 7.1302 5.60001C8.2902 2.91001 9.5902 2.07001 11.9402 2.71001Z"
                      fill="#FEA501"
                    />
                    <path
                      d="M18.7301 8.58999L18.7101 8.57999C18.1101 8.40999 17.5001 8.31999 16.8801 8.31999H10.6201L12.8701 3.08999L12.9001 3.01999C13.0401 3.06999 13.1901 3.13999 13.3401 3.18999L15.5501 4.11999C16.7801 4.62999 17.6401 5.15999 18.1701 5.79999C18.2601 5.91999 18.3401 6.02999 18.4201 6.15999C18.5101 6.29999 18.5801 6.43999 18.6201 6.58999C18.6601 6.67999 18.6901 6.75999 18.7101 6.84999C18.8601 7.35999 18.8701 7.93999 18.7301 8.58999Z"
                      fill="#FEA501"
                    />
                    <path
                      d="M12.52 18.16H12.77C13.07 18.16 13.32 17.89 13.32 17.56C13.32 17.14 13.2 17.08 12.94 16.98L12.52 16.83V18.16Z"
                      fill="#FEA501"
                    />
                    <path
                      d="M18.2902 10.02C17.8402 9.89001 17.3702 9.82001 16.8802 9.82001H7.12023C6.44023 9.82001 5.80023 9.95001 5.20023 10.21C3.46023 10.96 2.24023 12.69 2.24023 14.7V16.65C2.24023 16.89 2.26023 17.12 2.29023 17.36C2.51023 20.54 4.21023 22.24 7.39023 22.45C7.62023 22.48 7.85023 22.5 8.10023 22.5H15.9002C19.6002 22.5 21.5502 20.74 21.7402 17.24C21.7502 17.05 21.7602 16.85 21.7602 16.65V14.7C21.7602 12.49 20.2902 10.63 18.2902 10.02ZM13.2802 16C13.7402 16.16 14.3602 16.5 14.3602 17.56C14.3602 18.47 13.6502 19.2 12.7702 19.2H12.5202V19.42C12.5202 19.71 12.2902 19.94 12.0002 19.94C11.7102 19.94 11.4802 19.71 11.4802 19.42V19.2H11.3902C10.4302 19.2 9.64023 18.39 9.64023 17.39C9.64023 17.1 9.87023 16.87 10.1602 16.87C10.4502 16.87 10.6802 17.1 10.6802 17.39C10.6802 17.81 11.0002 18.16 11.3902 18.16H11.4802V16.47L10.7202 16.2C10.2602 16.04 9.64023 15.7 9.64023 14.64C9.64023 13.73 10.3502 13 11.2302 13H11.4802V12.78C11.4802 12.49 11.7102 12.26 12.0002 12.26C12.2902 12.26 12.5202 12.49 12.5202 12.78V13H12.6102C13.5702 13 14.3602 13.81 14.3602 14.81C14.3602 15.1 14.1302 15.33 13.8402 15.33C13.5502 15.33 13.3202 15.1 13.3202 14.81C13.3202 14.39 13.0002 14.04 12.6102 14.04H12.5202V15.73L13.2802 16Z"
                      fill="#FEA501"
                    />
                    <path
                      d="M10.6802 14.64C10.6802 15.06 10.8002 15.12 11.0602 15.22L11.4802 15.37V14.04H11.2302C10.9202 14.04 10.6802 14.31 10.6802 14.64Z"
                      fill="#FEA501"
                    />
                  </svg>
                </p>
              </div>
              <div className="flex flex-col gap-4 contet-div">
                <p className="text-2xl font-semibold ">أفضل الأسعار مضمونة</p>
                <p>العثور على سعر أقل؟ سنرد لك أموالك بنسبة 100% من الفرق.</p>
              </div>
            </div>
            <div className="content-slice flex gap-10 items-center ">
              <div className="icon-div flex justify-center items-center bg-[#FFF3DE] h-[64px] w-[64px]  rounded-xl">
                <p>
                  <svg
                    width="24"
                    height="26"
                    viewBox="0 0 24 26"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M12.125 0.140625L23.5 5.82812V20.0469L12.125 25.7207L0.75 20.0469V5.82812L12.125 0.140625ZM20.6699 6.375L12.125 2.10938L8.83008 3.75L17.3203 8.04297L20.6699 6.375ZM12.125 10.6406L15.3789 9.02734L6.875 4.73438L3.58008 6.375L12.125 10.6406ZM2.5 7.79688V18.9531L11.25 23.3281V12.1719L2.5 7.79688ZM13 23.3281L21.75 18.9531V7.79688L13 12.1719V23.3281Z"
                      fill="#FEA501"
                    />
                  </svg>
                </p>
              </div>
              <div className="flex flex-col gap-4 contet-div">
                <p className="text-2xl font-semibold ">منتجات ذات جودة عالية</p>
                <p className=" font-bold opacity-70 text-xl">
                  نحن نقدم مجموعة واسعة من زيوت السيارات وقطع الغيار عالية
                  الجودة.
                </p>
              </div>
            </div>
            <div className="content-slice flex gap-10 items-center ">
              <div className="icon-div flex justify-center items-center bg-[#FFF3DE] h-[64px] w-[64px]  rounded-xl">
                <p>
                  <svg
                    width="18"
                    height="21"
                    viewBox="0 0 18 21"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M15 0.5H3C1.34 0.5 0 1.83 0 3.47V14.38C0 16.02 1.34 17.35 3 17.35H3.76C4.56 17.35 5.32 17.66 5.88 18.22L7.59 19.91C8.37 20.68 9.64 20.68 10.42 19.91L12.13 18.22C12.69 17.66 13.46 17.35 14.25 17.35H15C16.66 17.35 18 16.02 18 14.38V3.47C18 1.83 16.66 0.5 15 0.5ZM7.38 11.51C7.79 11.51 8.13 11.85 8.13 12.26C8.13 12.67 7.79 13.01 7.38 13.01H5.38C4.97 13.01 4.63 12.67 4.63 12.26C4.63 11.85 4.97 11.51 5.38 11.51H7.38ZM12.63 9.01H5.38C4.97 9.01 4.63 8.67 4.63 8.26C4.63 7.85 4.97 7.51 5.38 7.51H12.63C13.04 7.51 13.38 7.85 13.38 8.26C13.38 8.67 13.04 9.01 12.63 9.01ZM12.63 6.51H5.38C4.97 6.51 4.63 6.17 4.63 5.76C4.63 5.35 4.97 5.01 5.38 5.01H12.63C13.04 5.01 13.38 5.35 13.38 5.76C13.38 6.17 13.04 6.51 12.63 6.51Z"
                      fill="#FEA501"
                    />
                  </svg>
                </p>
              </div>
              <div className="flex flex-col gap-4 contet-div">
                <p className="text-2xl font-semibold ">رضا العملاء</p>
                <p className=" font-bold opacity-70 text-xl">
                  نحن نعطي الأولوية لرضاك عن كل عملية شراء وتفاعل
                </p>
              </div>
            </div>
            <div className="content-slice flex gap-10 items-center">
              <div className="icon-div flex justify-center items-center bg-[#FFF3DE] h-[64px] w-[64px]  rounded-xl">
                <p>
                  <svg
                    width="23"
                    height="28"
                    viewBox="0 0 23 28"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      fillRule="evenodd"
                      clipRule="evenodd"
                      d="M11.2085 0.916666C10.4874 0.916666 9.79591 1.19674 9.28605 1.69527C8.77619 2.19381 8.48975 2.86997 8.48975 3.575V4.90417H7.13037C6.49726 4.90417 5.87285 5.04829 5.30658 5.32514C4.74031 5.60198 4.24774 6.00393 3.86787 6.49917L1.14912 10.0441C0.61969 10.7343 0.333496 11.5738 0.333496 12.4366V23.5125C0.333496 24.57 0.763155 25.5843 1.52795 26.3321C2.29275 27.0799 3.33004 27.5 4.41162 27.5H18.0054C19.087 27.5 20.1242 27.0799 20.889 26.3321C21.6538 25.5843 22.0835 24.57 22.0835 23.5125V8.89167C22.0835 7.83412 21.6538 6.81988 20.889 6.07208C20.1242 5.32428 19.087 4.90417 18.0054 4.90417V3.575C18.0054 2.86997 17.7189 2.19381 17.2091 1.69527C16.6992 1.19674 16.0077 0.916666 15.2866 0.916666H11.2085ZM15.2866 4.90417V3.575H11.2085V4.90417H15.2866ZM8.48975 14.2083C8.48975 13.8558 8.34653 13.5177 8.09159 13.2685C7.83666 13.0192 7.4909 12.8792 7.13037 12.8792C6.76984 12.8792 6.42408 13.0192 6.16915 13.2685C5.91422 13.5177 5.771 13.8558 5.771 14.2083V20.8542C5.771 21.2067 5.91422 21.5448 6.16915 21.794C6.42408 22.0433 6.76984 22.1833 7.13037 22.1833C7.4909 22.1833 7.83666 22.0433 8.09159 21.794C8.34653 21.5448 8.48975 21.2067 8.48975 20.8542V14.2083Z"
                      fill="#FEA501"
                    />
                  </svg>
                </p>
              </div>
              <div className="flex flex-col gap-4 contet-div">
                <p className="text-2xl font-semibold ">اختيار الزيت المتميز</p>
                <p className=" font-bold opacity-70 text-xl">
                  استكشف مجموعتنا الواسعة من زيوت السيارات المتميزة المصممة
                  لتحقيق الأداء الأمثل.
                </p>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
}

export default WhyUs;
